read_verilog -sv -formal -overwrite {workspace}/rtl/vga_ctrl.v
design -reset-vlog; proc;
write_json {workspace}/netlist/vga_ctrl.json